# encoding: utf-8

attr_value_title = {
    'author': {
        'title': {
            'ru': 'Автор'
        },
    },
    #########################################################
    'author_name_corporate': {
        'title': {
            'ru': 'Коллектив'
        },
    },
    #########################################################
    'autograph': {
        'title': {
            'ru': 'Автограф'
        },
    },
    #########################################################
    'catalog': {
        'title': {
            'ru': 'Каталог'
        },
        'values': {
            'BOOKS': {
                'ru': 'Книги',
            },
            'DEP': {
                'ru': 'Фонд редких книг',
            },
            'MAG_R': {
                'ru': 'Журналы на русск. языке',
            },
            'MAG_F': {
                'ru': 'Журналы на иностр. языке',
            },
            'ND': {
                'ru': 'Неопубликованные документы',
            },
        }
    },
    #########################################################
    'code_language': {
        'title': {
            'ru': 'Язык'
        },
        'values': {
            'rus': {
                'ru': 'Русский',
            },
            'eng': {
                'ru': 'Английски',
            },
            'ger': {
                'ru': 'Немецкий',
            },
            'fre': {
                'ru': 'Французский',
            },
            'ita': {
                'ru': 'Итальянский',
            },
            'dan': {
                'ru': 'Датский',
            },
            'ukr': {
                'ru': 'Украинский',
            },
            'spa': {
                'ru': 'Испанский',
            },
            'chi': {
                'ru': 'Китайский',
            },
            'ara': {
                'ru': 'Арабский',
            },
            'vie': {
                'ru': 'Вьетнамский',
            },
            'fin': {
                'ru': 'Финский',
            },
            'swe': {
                'ru': 'Швейцарский',
            },
            'dut': {
                'ru': 'Голландский',
            },
            'lat': {
                'ru': 'Латинский',
            },
            'nor': {
                'ru': 'Норвежский',
            },
            'jpn': {
                'ru': 'Японский',
            },
            'est': {
                'ru': 'Эстонский',
            },
            'pol': {
                'ru': 'Польский',
            },
            'mul': {
                'ru': 'Многоязычный',
            },
            'rum': {
                'ru': 'Румынский',
            },
            'per': {
                'ru': 'Персидский',
            },
            'bul': {
                'ru': 'Болгарский',
            },
            'cze': {
                'ru': 'Чешский',
            },
            'hun': {
                'ru': 'Венгерский',
            },
            'por': {
                'ru': 'Португальский',
            },
            'scc': {
                'ru': 'Сербский',
            },
            'bel': {
                'ru': 'Белорусский',
            },
            'hin': {
                'ru': 'Хинди',
            },
            'gre': {
                'ru': 'Греческий',
            },
            'tue': {
                'ru': 'Турецкий',
            },
            'urd': {
                'ru': 'Урду',
            },
            'kor': {
                'ru': 'Корейский',
            },
            'pus': {
                'ru': 'Пушту',
            },
            'aze': {
                'ru': 'Азербайджанский',
            },
            'heb': {
                'ru': 'Иврит',
            },
            'mon': {
                'ru': 'Монгольский',
            },
            'lav': {
                'ru': 'Латвийский',
            },
            'tuk': {
                'ru': 'Туркменский',
            },
            'ru': {
                'ru': 'Русский',
            }
        }
    },
    'system_collection': {
        'title': {
            'ru': 'Коллекция'
        },
        'values': {
            'chelreglib.chel_elib.Газета "Утро Сибири". 1918-1919 гг.': {
                'ru': 'Газета "Утро Сибири". 1918-1919\u00A0гг."',
            },
            'chelreglib.chel_elib.Газета «Власть народа». 1918 г.': {
                'ru': 'Газета «Власть народа». 1918\u00A0г.',
            },
            'chelreglib.chel_elib.Газета «Курганская свободная мысль». 1918–1919 гг.': {
                'ru': 'Газета «Курганская свободная мысль». 1918–1919\u00A0гг.',
            },
            'chelreglib.chel_elib.Газета «Вестник Приуралья». 1919 г.': {
                'ru': 'Газета «Вестник Приуралья». 1919\u00A0г.',
            },
            'chelreglib.chel_elib.Народное образование на Урале': {
                'ru': 'Народное образование на Урале',
            },
            'chelreglib.chel_elib.Уральская область': {
                'ru': 'Уральская область',
            },
            'chelreglib.chel_elib.Оренбургская губерния': {
                'ru': 'Оренбургская губерния',
            },
            'chelreglib.chel_elib.Челябинская область: история': {
                'ru': 'Челябинская область: история',
            },
            'chelreglib.chel_elib.Урал. XIX-XXI вв.': {
                'ru': 'Урал. XIX-XXI\u00A0вв.',
            },
            'chelreglib.chel_elib.Челябинская губерния. 1919-1923 гг.': {
                'ru': 'Челябинская губерния. 1919-1923\u00A0гг.',
            },
            'chelreglib.chel_elib.Уфимская губерния. 1865–1919 гг.': {
                'ru': 'Уфимская губерния. 1865–1919\u00A0гг.',
            },
            'chelreglib.chel_elib.Библиотеки Урала. XIX-XXI вв.': {
                'ru': 'Библиотеки Урала. XIX-XXI\u00A0вв.',
            },
            'chelreglib.chel_elib.Гражданская война на Урале': {
                'ru': 'Гражданская война на Урале',
            },
            'chelreglib.chel_elib.Календари знаменательных дат': {
                'ru': 'Календари знаменательных дат',
            },
            'chelreglib.chel_elib.Природа Урала': {
                'ru': 'Природа Урала',
            },
            'chelreglib.chel_elib.Краеведы и краеведение': {
                'ru': 'Краеведы и краеведение',
            },
            'chelreglib.chel_elib.Челябинск. XIX–XXI вв.': {
                'ru': 'Челябинск. XIX–XXI\u00A0вв.',
            },
            'chelreglib.chel_elib.Музыкальная жизнь Урала': {
                'ru': 'Музыкальная жизнь Урала',
            },
            'chelreglib.chel_elib.Оренбургское казачье войско': {
                'ru': 'Оренбургское казачье войско',
            },
            'chelreglib.chel_elib.Религия на Урале': {
                'ru': 'Религия на Урале',
            },
        }
    },
    'system_database': {
        'title': {
            'ru': 'База'
        },
        'values': {
            'chelreglib.chel_elib': {
                'ru': 'Электронная библиотека',
            },
            'cbs.cbs_agapov': {
                'ru': 'Агаповский МР',
            },
            'cbs.cbs_argayash': {
                'ru': 'Аргаяшский МР',
            },
            'cbs.cbs_ashin': {
                'ru': 'Ашинский МР',
            },
            'cbs.cbs_bredin': {
                'ru': 'Брединский МР',
            },
            'cbs.cbs_warnen': {
                'ru': 'Варненский МР',
            },
            'cbs.cbs_vural': {
                'ru': 'Верхнеуральский МР',
            },
            'cbs.cbs_vufaley': {
                'ru': 'Верхнеуфалейский ГО',
            },
            'cbs.cbs_emanzelin': {
                'ru': 'Еманжелинский МР',
            },
            'cbs.cbs_zlatoust': {
                'ru': 'Златоустовский ГО',
            },
            'cbs.cbs_karabash': {
                'ru': 'Карабашский ГО',
            },
            'cbs.cbs_kartalin': {
                'ru': 'Карталинский МР',
            },
            'cbs.cbs_kaslin': {
                'ru': 'Каслинский МР',
            },
            'cbs.cbs_katavivanov': {
                'ru': 'Катав-Ивановский МР',
            },
            'cbs.cbs_kizil': {
                'ru': 'Кизильский МР',
            },
            'cbs.cbs_kopeysk': {
                'ru': 'Копейский ГО',
            },
            'cbs.cbs_korkin': {
                'ru': 'Коркинский МР',
            },
            'cbs.cbs_krasnoarme': {
                'ru': 'Красноармейский МР',
            },
            'cbs.cbs_kunashak': {
                'ru': 'Кунашакский МР',
            },
            'cbs.cbs_kusin': {
                'ru': 'Кусинский МР',
            },
            'cbs.cbs_kyshtym': {
                'ru': 'Кыштымский ГО',
            },
            'cbs.cbs_magnitogorsk': {
                'ru': 'Магнитогорский ГО',
            },
            'cbs.cbsd_magnitogorsk': {
                'ru': 'Магнитогорский ГО (детская)',
            },
            'cbs.cbs_miass': {
                'ru': 'Миасский ГО',
            },
            'cbs.cbs_nagaibak': {
                'ru': 'Нагайбакский МР',
            },
            'cbs.cbs_njazepetrov': {
                'ru': 'Нязепетровский МР',
            },
            'cbs.cbs_oktyabrsk': {
                'ru': 'Октябрьский МР',
            },
            'cbs.cbs_plastov': {
                'ru': 'Пластовский МР',
            },
            'cbs.cbs_snezhinsk': {
                'ru': 'Снежинский ГО',
            },
            'cbs.cbs_sosnov': {
                'ru': 'Сосновский МР',
            },
            'cbs.cbs_trekhgorn': {
                'ru': 'Трехгорный ГО',
            },
            'cbs.cbs_troitsk': {
                'ru': 'Троицкий ГО',
            },
            'cbs.cbs_troitskr': {
                'ru': 'Троицкий МР',
            },
            'cbs.cbs_uvelka': {
                'ru': 'Увельский МР',
            },
            'cbs.cbs_uyskoe': {
                'ru': 'Уйский МР',
            },
            'cbs.cbs_ustkatav': {
                'ru': 'Усть-Катавский ГО',
            },
            'cbs.cbs_chebarkulg': {
                'ru': 'Чебаркульский ГО',
            },
            'cbs.cbs_chebarkul': {
                'ru': 'Чебаркульский МР',
            },
            'cbs.cbs_cheljabinsk': {
                'ru': 'Челябинский ГО',
            },
            'cbs.cbsd_cheljabinsk': {
                'ru': 'Челябинский ГО (детская)',
            },
            'cbs.cbs_chesmen': {
                'ru': 'Чесменский МР',
            },
            'cbs.cbs_yuzhnouralsk': {
                'ru': 'Южноуральский ГО',
            },
        }
    },
    'system_source': {
        'title': {
            'ru': 'Источник'
        },
        'values': {
            'analytics': {
                'ru': 'Аналитика',
            },
            'chelreglib': {
                'ru': 'Челябинская ОУНБ',
            },
            'cbs': {
                'ru': 'Библиотеки Челябинской области',
            },
            'spstu': {
                'ru': 'ФБ СПбПУ',
            },
            'viniti': {
                'ru': 'ВИНИТИ',
            },
        }
    },
    'document_type': {
        'title': {
            'ru': 'Вид документа'
        },
        'values': {
            'article': {
                'ru': 'статья',
            },
            'author_abstract': {
                'ru': 'автореферат',
            },
            'dict': {
                'ru': 'словарь',
            },
            'disser': {
                'ru': 'диссертация',
            },
            'encyc': {
                'ru': 'энциклопедия',
            },
            'issue': {
                'ru': 'выпуск',
            },
            'journal_np': {
                'ru': 'журнал, газета',
            },
            'other': {
                'ru': 'не определен',
            },
            'ref': {
                'ru': 'справочник',
            },
            'tech_report': {
                'ru': 'технический отчет',
            },
            'textbook': {
                'ru': 'учебник',
            }
        },
    },
    'source': {
        'title': {
            'ru': 'Источник'
        },
        'values': {
            'spbstu_uc': {
                'ru': 'Электронный каталог',
            },
            'spbstu_edoc': {
                'ru': 'Электронная библиотека',
            }
        },
    },
    'content_type': {
        'title': {
            'ru': 'Тип контента'
        },
        'values': {
            'a': {
                'ru': 'библиографическое издание',
            },
            'b': {
                'ru': 'каталог',
            },
            'c': {
                'ru': 'указатель',
            },
            'd': {
                'ru': 'реферат',
            },
            'e': {
                'ru': 'словарь',
            },
            'f': {
                'ru': 'энциклопедия',
            },
            'g': {
                'ru': 'справочное издание',
            },
            'h': {
                'ru': 'описание проекта',
            },
            'i': {
                'ru': 'статистические данные',
            },
            'j': {
                'ru': 'учебник',
            },
            'k': {
                'ru': 'патент',
            },
            'l': {
                'ru': 'стандарт',
            },
            'm': {
                'ru': 'диссертация',
            },
            'n': {
                'ru': 'законы',
            },
            'o': {
                'ru': 'словарь',
            },
            'p': {
                'ru': 'технический отчет',
            },
            'q': {
                'ru': 'экзаменационный лист',
            },
            'r': {
                'ru': 'литературный обзор/рецензия',
            },
            's': {
                'ru': 'договоры',
            },
            't': {
                'ru': 'карикатуры или комиксы',
            },
            'w': {
                'ru': 'религиозные тексты',
            },
            'z': {
                'ru': 'другое',
            },
        }
    },
    #########################################################
    'date_of_publication': {
        'title': {
            'ru': 'Дата публикации'
        }
    },
    #########################################################
    'date_of_publication_of_original': {
        'title': {
            'ru': 'Год издания оригинала'
        }
    },
    #########################################################
    'date_time_added_to_db': {
        'title': {
            'ru': 'Дата ввода в БД'
        }
    },
    'first_letter': {
        'title': {
            'ru': 'A to Z'
        }
    },
    #########################################################
    'full_text': {
        'title': {
            'ru': 'Полный текст'
        }
    },
    #########################################################
    'has_full_text_url': {
        'title': {
            'ru': 'Полный текст'
        },
        'values': {
            '1': {
                'ru': 'Есть',
            },
        }
    },
    #########################################################
    'host_item': {
        'title': {
            'ru': 'Источник статьи'
        }
    },
    #########################################################
    'isbn': {
        'title': {
            'ru': 'ISBN'
        }
    },
    #########################################################
    'issn': {
        'title': {
            'ru': 'ISSN'
        }
    },
    #########################################################
    'literary_incipit': {
        'title': {
            'ru': 'Инцип'
        }
    },
    #########################################################
    'local_number': {
        'title': {
            'ru': 'Контрольный номер'
        }
    },
    'material_type': {
        'title': {
            'ru': 'Вид документа'
        },
        'values': {
            'monography': {
                'ru': 'монография',
            },
            'journal_paper': {
                'ru': 'журнал/газета',
            },
            'issues': {
                'ru': 'выпуск',
            },
            'articles_reports': {
                'ru': 'статья/доклад',
            },
            'collections': {
                'ru': 'подборка',
            },
            'integrity': {
                'ru': 'интегрируемый ресурс',
            },
            'texts': {
                'ru': 'текст',
            },
            'musical_scores': {
                'ru': 'музыкальная партитура',
            },
            'maps': {
                'ru': 'карты',
            },
            'video': {
                'ru': 'видео',
            },
            'sound_records': {
                'ru': 'звукозапись',
            },
            'graphics': {
                'ru': 'графика',
            },
            'e_resources': {
                'ru': 'электронный ресурс',
            },
            'dissertation_abstracts': {
                'ru': 'диссертация/реферат',
            },
            'textbook': {
                'ru': 'учебник',
            },
            'patents': {
                'ru': 'патент',
            },
            'standarts': {
                'ru': 'стандарты',
            },
            'legislative_acts': {
                'ru': 'законодательный акт',
            },
            'technical_reports': {
                'ru': 'технический отчет',
            },
            'references': {
                'ru': 'справочник',
            },
            'dictionaries': {
                'ru': 'словарь',
            },
            'encyclopedias': {
                'ru': 'энциклопедия',
            },
        }
    },
    #########################################################
    'org_creator': {
        'title': {
            'ru': 'Организация создатель'
        }
    },
    #########################################################
    'owner': {
        'title': {
            'ru': 'Держатель'
        }
    },
    #########################################################
    'place_publication': {
        'title': {
            'ru': 'Место публикации'
        }
    },
    #########################################################
    'publisher': {
        'title': {
            'ru': 'Издательство'
        }
    },
    #########################################################
    'subject': {
        'title': {
            'ru': 'Тематика'
        }
    },
    #########################################################
    'subject_heading': {
        'title': {
            'ru': 'Тематика'
        }
    },
    #########################################################
    'subject_name_geographical': {
        'title': {
            'ru': 'География'
        }
    },
    #########################################################
    'subject_name_personal': {
        'title': {
            'ru': 'Персоналия'
        }
    },
    #########################################################
    'subject_subheading': {
        'title': {
            'ru': 'Подрубрика'
        }
    },
    #########################################################
    'subject_keywords': {
        'title': {
            'ru': 'Ключевые слова'
        }
    },
    #########################################################
    'title': {
        'title': {
            'ru': 'Заглавие'
        }
    },
    #########################################################
    'title_series': {
        'title': {
            'ru': 'Заглавие серии'
        }
    },
    #########################################################
    'type': {
        'title': {
            'ru': 'Тип БД'
        }
    },
    #########################################################
    'all': {
        'title': {
            'ru': 'Везде'
        }
    },
    #########################################################
    'bbk': {
        'title': {
            'ru': 'ББК'
        }
    },
    #########################################################
    'udc': {
        'title': {
            'ru': 'УДК'
        }
    },
    #########################################################
    'grnti': {
        'title': {
            'ru': 'ГРНТИ'
        }
    },
    #########################################################
    'url_source': {
        'title': {
            'ru': 'Источник'
        },
        'values': {
            'elib': {
                'ru': 'Электронная библиотека',
            },
            'inner': {
                'ru': 'Внутренний',
            },
            'external': {
                'ru': 'Внешний',
            },
        }
    },
    #########################################################
    'system_source_id': {
        'title': {
            'ru': 'Базы'
        },
        'values': {
            'spstu': {
                'ru': 'ФБ СПбГПУ',
            },
            'mars': {
                'ru': 'МАРС',
            }
        }
    },
    'collection': {
        'title': {
            'ru': 'Электронная библиотека'
        },
        # 'values': {
        #     u'Уральская область.Уральская электронная библиотека': {
        #         u'ru': u'Уральская область',
        #     }
        # }
    },

}


def get_attr_title(attr, lang='ru'):
    try:
        return attr_value_title[attr.lower()]['title'][lang]
    except KeyError:
        pass

    parts = attr.split('_')
    # if len(parts) < 2:
    #     return attr
    #     #raise ValueError(u'Неправильный атрибут')
    try:
        return attr_value_title['_'.join(parts[:-1])]['title'][lang]
    except KeyError:
        return attr


def get_attr_value_title(attr, value, lang='ru'):
    try:
        return attr_value_title[attr]['values'][value][lang]
    except KeyError:
        pass

    try:
        return attr_value_title[attr.lower()]['values'][value.lower()][lang]
    except KeyError:
        pass

    parts = attr.split('_')
    # if len(parts) < 2:
    #
    #     raise ValueError(u'Неправильный атрибут')
    try:
        return attr_value_title['_'.join(parts[:-1])]['values'][value][lang]
    except KeyError:
        pass

    try:
        return attr_value_title['_'.join(parts[:-1])]['values'][value.lower()][lang]
    except KeyError:
        return value
