# encoding: utf-8

attr_value_title = {
    u'author': {
        'title': {
            u'ru': u'Автор'
        },
    },
    #########################################################
    u'author_name_corporate': {
        'title': {
            u'ru': u'Коллектив'
        },
    },
    #########################################################
    u'autograph': {
        'title': {
            u'ru': u'Автограф'
        },
    },
    #########################################################
    u'catalog': {
        'title': {
            u'ru': u'Каталог'
        },
        'values': {
            u'BOOKS': {
                u'ru': u'Книги',
            },
            u'DEP': {
                u'ru': u'Фонд редких книг',
            },
            u'MAG_R': {
                u'ru': u'Журналы на русск. языке',
            },
            u'MAG_F': {
                u'ru': u'Журналы на иностр. языке',
            },
            u'ND': {
                u'ru': u'Неопубликованные документы',
            },
        }
    },
    #########################################################
    u'code_language': {
        'title': {
            u'ru': u'Язык'
        },
        'values': {
            u'rus': {
                u'ru': u'Русский',
            },
            u'eng': {
                u'ru': u'Английски',
            },
            u'ger': {
                u'ru': u'Немецкий',
            },
            u'fre': {
                u'ru': u'Французский',
            },
            u'ita': {
                u'ru': u'Итальянский',
            },
            u'dan': {
                u'ru': u'Датский',
            },
            u'ukr': {
                u'ru': u'Украинский',
            },
            u'spa': {
                u'ru': u'Испанский',
            },
            u'chi': {
                u'ru': u'Китайский',
            },
            u'ara': {
                u'ru': u'Арабский',
            },
            u'vie': {
                u'ru': u'Вьетнамский',
            },
            u'fin': {
                u'ru': u'Финский',
            },
            u'swe': {
                u'ru': u'Швейцарский',
            },
            u'dut': {
                u'ru': u'Голландский',
            },
            u'lat': {
                u'ru': u'Латинский',
            },
        }
    },
    u'source':{
        'title': {
            u'ru': u'Каталог'
        },
        'values': {
            u'chelreglib.chelreglib': {
                u'ru': u'Аудиовизуальные документы',
            },
            u'chelreglib.books': {
                u'ru': u'Книги',
            },
            u'chelreglib.ural_el': {
                u'ru': u'Уральская электронная библиотека',
            },
            u'chelreglib.kraychel': {
                u'ru': u'Челябинская область',
            },
            u'chelreglib.cbsd_cheljabinsk': {
                u'ru': u'Челябинский городской округ (Детские библиотеки)',
            },
            u'chelreglib.notes': {
                u'ru': u'Нотные издания',
            },
            u'chelreglib.arts': {
                u'ru': u'Статьи по искусству',
            },
            u'chelreglib.cbs_kopeysk': {
                u'ru': u'Копейский городской округ',
            },
            u'chelreglib.periodics': {
                u'ru': u'Периодические издания',
            },
            u'chelreglib.languages': {
                u'ru': u'Литература на иностранных языках',
            },
            u'chelreglib.staff': {
                u'ru': u'Издания и публикации сотрудников ЧОУНБ',
            },
            u'chelreglib.civil_press': {
                u'ru': u'«Русская книга гражданской печати XVIII в.»',
            },
            u'chelreglib.pokrovsk_br': {
                u'ru': u'Библиотека «Товарищества “Бр. Покровские”»',
            },
            u'chelreglib.analytics': {
                u'ru': u'Статьи',
            },
        },
    },
    u'content_type': {
        'title': {
            u'ru': u'Тип содержания'
        },
        'values': {
            u'a': {
                u'ru': u'библиографическое издание',
            },
            u'b': {
                u'ru': u'каталог',
            },
            u'c': {
                u'ru': u'указатель',
            },
            u'd': {
                u'ru': u'реферат',
            },
            u'e': {
                u'ru': u'словарь',
            },
            u'f': {
                u'ru': u'энциклопедия',
            },
            u'g': {
                u'ru': u'справочное издание',
            },
            u'h': {
                u'ru': u'описание проекта',
            },
            u'i': {
                u'ru': u'статистические данные',
            },
            u'j': {
                u'ru': u'учебник',
            },
            u'k': {
                u'ru': u'патент',
            },
            u'l': {
                u'ru': u'стандарт',
            },
            u'm': {
                u'ru': u'диссертация',
            },
            u'n': {
                u'ru': u'законы',
            },
            u'o': {
                u'ru': u'словарь',
            },
            u'p': {
                u'ru': u'технический отчет',
            },
            u'q': {
                u'ru': u'экзаменационный лист',
            },
            u'r': {
                u'ru': u'литературный обзор/рецензия',
            },
            u's': {
                u'ru': u'договоры',
            },
            u't': {
                u'ru': u'карикатуры или комиксы',
            },
            u'w': {
                u'ru': u'религиозные тексты',
            },
            u'z': {
                u'ru': u'другое',
            },
        }
    },
    #########################################################
    u'date_of_publication': {
        'title': {
            u'ru': u'Дата публикации'
        }
    },
    #########################################################
    u'date_of_publication_of_original': {
        'title': {
            u'ru': u'Год издания оригинала'
        }
    },
    #########################################################
    u'date_time_added_to_db_t': {
        'title': {
            u'ru': u'Дата ввода в БД'
        }
    },
    #########################################################
    u'full_text': {
        'title': {
            u'ru': u'Полный текст'
        }
    },
    #########################################################
    u'host_item': {
        'title': {
            u'ru': u'Источник статьи'
        }
    },
    #########################################################
    u'isbn': {
        'title': {
            u'ru': u'ISBN'
        }
    },
    #########################################################
    u'issn': {
        'title': {
            u'ru': u'ISSN'
        }
    },
    #########################################################
    u'literary_incipit': {
        'title': {
            u'ru': u'Инцип'
        }
    },
    #########################################################
    u'owner': {
        'title': {
            u'ru': u'Держатель'
        }
    },
    #########################################################
    u'place_publication': {
        'title': {
            u'ru': u'Место публикации'
        }
    },
    #########################################################
    u'publisher': {
        'title': {
            u'ru': u'Издательство'
        }
    },
    #########################################################
    u'subject_heading': {
        'title': {
            u'ru': u'Предмет'
        }
    },
    #########################################################
    u'subject_name_geographical': {
        'title': {
            u'ru': u'География'
        }
    },
    #########################################################
    u'subject_name_personal': {
        'title': {
            u'ru': u'Персоналия'
        }
    },
    #########################################################
    u'subject_subheading': {
        'title': {
            u'ru': u'Подрубрика'
        }
    },
    #########################################################
    u'subject_keywords': {
        'title': {
            u'ru': u'Ключевые слова'
        }
    },
    #########################################################
    u'title': {
        'title': {
            u'ru': u'Заглавие'
        }
    },
    #########################################################
    u'title_series': {
        'title': {
            u'ru': u'Заглавие серии'
        }
    },
    #########################################################
    u'all': {
        'title': {
            u'ru': u'Везде'
        }
    },
    #########################################################
    u'bbk': {
        'title': {
            u'ru': u'ББК'
        }
    },
    #########################################################
    u'udk': {
        'title': {
            u'ru': u'УДК'
        }
    },
    #########################################################
    u'grnti': {
        'title': {
            u'ru': u'ГРНТИ'
        }
    },
    #########################################################
    u'has_e_version': {
        'title': {
            u'ru': u'Полные тексты'
        },
        'values': {
            u'true': {
                u'ru': u'есть',
            },
            u'false': {
                u'ru': u'нет',
            },
        }
    },
    u'collection': {
        'title': {
            u'ru': u'Электронная библиотека'
        },
        # 'values': {
        #     u'Уральская область.Уральская электронная библиотека': {
        #         u'ru': u'Уральская область',
        #     }
        # }
    },
}

def get_attr_title(attr, lang=u'ru'):
    try:
        return attr_value_title[attr]['title'][lang]
    except KeyError:
        pass

    parts = attr.split(u'_')
    # if len(parts) < 2:
    #     return attr
    #     #raise ValueError(u'Неправильный атрибут')
    try:
        return attr_value_title[u'_'.join(parts[:-1])]['title'][lang]
    except KeyError:
        return attr


def get_attr_value_title(attr, value, lang=u'ru'):

    try:
        return attr_value_title[attr]['values'][value][lang]
    except KeyError:
        pass

    parts = attr.split(u'_')
    # if len(parts) < 2:
    #
    #     raise ValueError(u'Неправильный атрибут')
    try:
        return attr_value_title[u'_'.join(parts[:-1])]['values'][value][lang]
    except KeyError:
        return value