# encoding: utf-8

attr_value_title = {
    'author': {
        'title': {
            'ru': 'Автор'
        },
    },
    #########################################################
    'author_name_corporate': {
        'title': {
            'ru': 'Коллектив'
        },
    },
    #########################################################
    'autograph': {
        'title': {
            'ru': 'Автограф'
        },
    },
    #########################################################
    'catalog': {
        'title': {
            'ru': 'Каталог'
        },
        'values': {
            'BOOKS': {
                'ru': 'Книги',
            },
            'DEP': {
                'ru': 'Фонд редких книг',
            },
            'MAG_R': {
                'ru': 'Журналы на русск. языке',
            },
            'MAG_F': {
                'ru': 'Журналы на иностр. языке',
            },
            'ND': {
                'ru': 'Неопубликованные документы',
            },
        }
    },
    #########################################################
    'code_language': {
        'title': {
            'ru': 'Язык'
        },
        'values': {
            'rus': {
                'ru': 'Русский',
            },
            'eng': {
                'ru': 'Английски',
            },
            'ger': {
                'ru': 'Немецкий',
            },
            'fre': {
                'ru': 'Французский',
            },
            'ita': {
                'ru': 'Итальянский',
            },
            'dan': {
                'ru': 'Датский',
            },
            'ukr': {
                'ru': 'Украинский',
            },
            'spa': {
                'ru': 'Испанский',
            },
            'chi': {
                'ru': 'Китайский',
            },
            'ara': {
                'ru': 'Арабский',
            },
            'vie': {
                'ru': 'Вьетнамский',
            },
            'fin': {
                'ru': 'Финский',
            },
            'swe': {
                'ru': 'Швейцарский',
            },
            'dut': {
                'ru': 'Голландский',
            },
            'lat': {
                'ru': 'Латинский',
            },
        }
    },
    'source':{
        'title': {
            'ru': 'Каталог'
        },
        'values': {
            'chelreglib.chelreglib': {
                'ru': 'Аудиовизуальные документы',
            },
            'chelreglib.books': {
                'ru': 'Книги',
            },
            'chelreglib.ural_el': {
                'ru': 'Уральская электронная библиотека',
            },
            'chelreglib.kraychel': {
                'ru': 'Челябинская область',
            },
            'chelreglib.cbsd_cheljabinsk': {
                'ru': 'Челябинский городской округ (Детские библиотеки)',
            },
            'chelreglib.notes': {
                'ru': 'Нотные издания',
            },
            'chelreglib.arts': {
                'ru': 'Статьи по искусству',
            },
            'chelreglib.cbs_kopeysk': {
                'ru': 'Копейский городской округ',
            },
            'chelreglib.periodics': {
                'ru': 'Периодические издания',
            },
            'chelreglib.languages': {
                'ru': 'Литература на иностранных языках',
            },
            'chelreglib.staff': {
                'ru': 'Издания и публикации сотрудников ЧОУНБ',
            },
            'chelreglib.civil_press': {
                'ru': '«Русская книга гражданской печати XVIII в.»',
            },
            'chelreglib.pokrovsk_br': {
                'ru': 'Библиотека «Товарищества “Бр. Покровские”»',
            },
            'chelreglib.analytics': {
                'ru': 'Статьи',
            },
        },
    },
    'content_type': {
        'title': {
            'ru': 'Тип содержания'
        },
        'values': {
            'a': {
                'ru': 'библиографическое издание',
            },
            'b': {
                'ru': 'каталог',
            },
            'c': {
                'ru': 'указатель',
            },
            'd': {
                'ru': 'реферат',
            },
            'e': {
                'ru': 'словарь',
            },
            'f': {
                'ru': 'энциклопедия',
            },
            'g': {
                'ru': 'справочное издание',
            },
            'h': {
                'ru': 'описание проекта',
            },
            'i': {
                'ru': 'статистические данные',
            },
            'j': {
                'ru': 'учебник',
            },
            'k': {
                'ru': 'патент',
            },
            'l': {
                'ru': 'стандарт',
            },
            'm': {
                'ru': 'диссертация',
            },
            'n': {
                'ru': 'законы',
            },
            'o': {
                'ru': 'словарь',
            },
            'p': {
                'ru': 'технический отчет',
            },
            'q': {
                'ru': 'экзаменационный лист',
            },
            'r': {
                'ru': 'литературный обзор/рецензия',
            },
            's': {
                'ru': 'договоры',
            },
            't': {
                'ru': 'карикатуры или комиксы',
            },
            'w': {
                'ru': 'религиозные тексты',
            },
            'z': {
                'ru': 'другое',
            },
        }
    },
    #########################################################
    'date_of_publication': {
        'title': {
            'ru': 'Дата публикации'
        }
    },
    #########################################################
    'date_of_publication_of_original': {
        'title': {
            'ru': 'Год издания оригинала'
        }
    },
    #########################################################
    'date_time_added_to_db': {
        'title': {
            'ru': 'Дата ввода в БД'
        }
    },
    #########################################################
    'full_text': {
        'title': {
            'ru': 'Полный текст'
        }
    },
    #########################################################
    'host_item': {
        'title': {
            'ru': 'Источник статьи'
        }
    },
    #########################################################
    'isbn': {
        'title': {
            'ru': 'ISBN'
        }
    },
    #########################################################
    'issn': {
        'title': {
            'ru': 'ISSN'
        }
    },
    #########################################################
    'literary_incipit': {
        'title': {
            'ru': 'Инцип'
        }
    },
    #########################################################
    'owner': {
        'title': {
            'ru': 'Держатель'
        }
    },
    #########################################################
    'place_publication': {
        'title': {
            'ru': 'Место публикации'
        }
    },
    #########################################################
    'publisher': {
        'title': {
            'ru': 'Издательство'
        }
    },
    #########################################################
    'subject_heading': {
        'title': {
            'ru': 'Предмет'
        }
    },
    #########################################################
    'subject_name_geographical': {
        'title': {
            'ru': 'География'
        }
    },
    #########################################################
    'subject_name_personal': {
        'title': {
            'ru': 'Персоналия'
        }
    },
    #########################################################
    'subject_subheading': {
        'title': {
            'ru': 'Подрубрика'
        }
    },
    #########################################################
    'subject_keywords': {
        'title': {
            'ru': 'Ключевые слова'
        }
    },
    #########################################################
    'title': {
        'title': {
            'ru': 'Заглавие'
        }
    },
    #########################################################
    'title_series': {
        'title': {
            'ru': 'Заглавие серии'
        }
    },
    #########################################################
    'all': {
        'title': {
            'ru': 'Везде'
        }
    },
    #########################################################
    'bbk': {
        'title': {
            'ru': 'ББК'
        }
    },
    #########################################################
    'udk': {
        'title': {
            'ru': 'УДК'
        }
    },
    #########################################################
    'grnti': {
        'title': {
            'ru': 'ГРНТИ'
        }
    },
    #########################################################
    'has_e_version': {
        'title': {
            'ru': 'Полные тексты'
        },
        'values': {
            'true': {
                'ru': 'есть',
            },
            'false': {
                'ru': 'нет',
            },
        }
    },
    'collection': {
        'title': {
            'ru': 'Коллекция'
        },
        # 'values': {
        #     u'Уральская область.Уральская электронная библиотека': {
        #         u'ru': u'Уральская область',
        #     }
        # }
    },
    'collection2': {
        'title': {
            'ru': 'Коллекция'
        },
    },
    'collection3': {
        'title': {
            'ru': 'Коллекция'
        },
    },
    'collection4': {
        'title': {
            'ru': 'Коллекция'
        },
    },
    'collection5': {
        'title': {
            'ru': 'Коллекция'
        },
    },
    'collection6': {
        'title': {
            'ru': 'Коллекция'
        },
    },
    'collection7': {
        'title': {
            'ru': 'Коллекция'
        },
    }

}

def get_attr_title(attr, lang='ru'):
    try:
        return attr_value_title[attr]['title'][lang]
    except KeyError:
        pass

    parts = attr.split('_')
    # if len(parts) < 2:
    #     return attr
    #     #raise ValueError(u'Неправильный атрибут')
    try:
        return attr_value_title['_'.join(parts[:-1])]['title'][lang]
    except KeyError:
        return attr


def get_attr_value_title(attr, value, lang='ru'):

    try:
        return attr_value_title[attr]['values'][value][lang]
    except KeyError:
        pass

    parts = attr.split('_')
    # if len(parts) < 2:
    #
    #     raise ValueError(u'Неправильный атрибут')
    try:
        return attr_value_title['_'.join(parts[:-1])]['values'][value][lang]
    except KeyError:
        return value