# -*- encoding: utf-8 -*-
from django.conf import settings
from django.template import Library
from ..frontend import titles
register = Library()



content_type_titles = {
    'a': 'библиографическое издание',
    'b': 'каталог',
    'c': 'указатель',
    'd': 'реферат',
    'e': 'словарь',
    'f': 'энциклопедия',
    'g': 'справочное издание',
    'h': 'описание проекта',
    'i': 'статистические данные',
    'j': 'учебник',
    'k': 'патент',
    'l': 'стандарт',
    'm': 'диссертация',
    'n': 'законы',
    'o': 'словарь',
    'p': 'технический отчет',
    'q': 'экзаменационный лист',
    'r': 'литературный обзор/рецензия',
    's': 'договоры',
    't': 'карикатуры или комиксы',
    'u': 'неизвестно',
    'w': 'религиозные тексты',
    'z': 'другое',
}

@register.filter
def content_type_title(code):
    return content_type_titles.get(code.lower(), code)
#

@register.filter
def attr_title(value, attr):
    return titles.get_attr_value_title(attr, value, 'ru')


language_titles = {
    'rus':"Русский",
    'eng':"Английский",
    'tat':"Татарский",
    'tar':"Татарский",
    'aze':"Азербайджанский",
    'amh':"Амхарский",
    'ara':"Арабский",
    'afr':"Африкаанс",
    'baq':"Баскский",
    'bak':"Башкирский",
    'bel':"Белорусский",
    'bal':"Белуджский",
    'bul':"Болгарский",
    'bua':"Бурятский",
    'hun':"Венгерский",
    'vie':"Вьетнамский",
    'dut':"Голландский",
    'gre':"Греческий",
    'geo':"Грузинский",
    'dan':"Датский",
    'dra':"Дравидийские",
    'grc':"Древнегреческий",
    'egy':"Египетский",
    'heb':"Иврит",
    'ind':"Индонезийский",
    'ira':"Иранские",
    'ice':"Исландский",
    'spa':"Испанский",
    'ita':"Итальянский",
    'kaz':"Казахский",
    'cat':"Каталанский",
    'kir':"Киргизский",
    'chi':"Китайский",
    'kor':"Корейский",
    'cpe':"Креольские",
    'cam':"Кхмерский",
    'khm':"Кхмерский",
    'lat':"Латинский",
    'lav':"Латышский",
    'lit':"Литовский",
    'mac':"Македонский",
    'chm':"Марийский",
    'mon':"Монгольский",
    'mul':"Многоязычный",
    'ger':"Немецкий",
    'nor':"Норвежский",
    'per':"Персидский",
    'pol':"Польский",
    'por':"Португальский",
    'rum':"Румынский",
    'sla':"Славянский",
    'slo':"Словацкий",
    'tib':"Тибетский",
    'tur':"Турецкий",
    'tus':'Tускарора',
    'uzb':"Узбекский",
    'ukr':"Украинский",
    'fin':"Финский",
    'fiu':"Финно-угорские",
    'fre':"Французский",
    'hin':"Хинди",
    'che':"Чеченский",
    'cze':"Чешский",
    'chv':"Чувашский",
    'swe':"Шведский",
    'est':"Эстонский",
    'epo':"Эсперанто",
    'esp':"Эсперанто",
    'eth':"Эфиопский",
    'gez':"Эфиопский",
    'jpn':"Японский",
    'jap':"Японский",

}

@register.filter
def language_title(code):
    return language_titles.get(code, code)
